; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image0 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	GroundStation6 - direction
	Star11 - direction
	Star0 - direction
	Star9 - direction
	Star5 - direction
	Star3 - direction
	GroundStation7 - direction
	Star4 - direction
	GroundStation10 - direction
	Star1 - direction
	GroundStation8 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation10)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star5)
	(supports instrument6 spectrograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 GroundStation10)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(pointing satellite2 GroundStation6)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon14 spectrograph1)
	(have_image Planet15 spectrograph2)
	(have_image Star16 spectrograph2)
	(have_image Planet17 spectrograph2)
	(have_image Phenomenon18 spectrograph2)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 9
2. (calibrate satellite2 instrument4 groundstation7)
   added: (calibrated instrument4)
   goals met: 1 of 9
3. (turn_to satellite2 planet12 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet12)
   goals met: 1 of 9
4. (take_image satellite2 planet12 instrument4 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 2 of 9
5. (turn_to satellite2 phenomenon18 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon18)
   goals met: 2 of 9
6. (take_image satellite2 phenomenon18 instrument4 spectrograph2)
   added: (have_image phenomenon18 spectrograph2)
   goals met: 3 of 9
7. (turn_to satellite2 phenomenon14 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 9
8. (take_image satellite2 phenomenon14 instrument4 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 4 of 9
9. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 4 of 9
10. (take_image satellite2 phenomenon13 instrument4 image0)
   added: (have_image phenomenon13 image0)
   goals met: 5 of 9
11. (turn_to satellite2 planet15 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet15)
   goals met: 5 of 9
12. (take_image satellite2 planet15 instrument4 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 6 of 9
13. (turn_to satellite2 planet17 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet17)
   goals met: 6 of 9
14. (take_image satellite2 planet17 instrument4 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 7 of 9
15. (turn_to satellite2 star16 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 star16)
   goals met: 7 of 9
16. (take_image satellite2 star16 instrument4 spectrograph2)
   added: (have_image star16 spectrograph2)
   goals met: 8 of 9
17. (turn_to satellite2 groundstation6 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 groundstation6)
   goals met: 9 of 9
